[
  {
    "image": {
      "source": "/fgco-screenshot.png?updatedAt=1759792486136",
      "alt": "Screenshot from forgoodandco.com",
      "width": 1920,
      "height": 1200
    },
    "title": "For Good & Company - Website, CMS",
    "description": [
      "This is the latest interation of the For Good & Company website. I worked closely with the creative team on the design and development of the site. Creative handed off Figma designs for the look and feel and components for the site.",
      "I also worked closely with the creative team on the design of the CMS. We wanted designers on our creative to be able to add case studies to the site. I chose a NextJS app because I like its routing and data fetching capabilities and how easy it is to intgrate with Sanity.io. I also enjoy working with Sanity.io because I like how easy it is to customize. Live previews of drafts for case studies allowed designers to make sure the page looked correct before publishing."
    ],
    "tools": ["NextJS", "React", "Sanity.io", "CMS", "CSS", "Figma", "Netlify"],
    "links": {
      "project": "https://forgoodandco.com"
    }
  },
  {
    "image": {
      "source": "/kpnwevents/kpnwevents-home.png?updatedAt=1760393820299",
      "alt": "kpnwevents.com Home Page",
      "width": "1920",
      "height": "1080"
    },
    "title": "Sunday Parkways",
    "description": [
      "Each Summer, Kaiser Permanente puts on Sunday Parkway events across Portland. There are typically 4 events that include a route for participants to ride or walk through the neighborhood in which the event is taking place. The site has details about each of the Sunday Parkway events as well as linking to articles about community and healthy living.",
      "This site was done working at For Good &amp; Co. I collaborated with the creative team to build a Figma file for client approval before building the site. I used NextJS and Netlify for hosting for ease of pushing changes to the site. "
    ],
    "tools": ["NextJS", "React", "CSS", "Figma", "Netlify"],
    "links": {
      "project": "https://kpnwevents.com"
    }
  },
  {
    "image": {
      "source": "/riverheadbooks/riverhead-books-home.png?updatedAt=1760394135813",
      "alt": "riverheadbooksvarietyshow.com Home Page",
      "width": "1920",
      "height": "1080"
    },
    "title": "Riverhead Variety Show",
    "description": [
      "Another For Good &amp; Co project that included a website to host a live playout for Riverhead's Variety Show. The live playout includes a chat for attendees to interact with one another while the show is playing. It also features a game using an AfterEffects animation using the Lottie export and controlled with React. The site also includes an archive of past shows that users can browse and watch.",
      "This is another NextJS site hosted on Netlify. TailwindCSS is used for the styles. Video embeds and live playout is from Vimeo."
    ],
    "tools": ["NextJS", "React", "Interactive", "Live Event", "TailwindCSS", "Netlify"],
    "links": {
      "project": "https://riverheadbooksvarietyshow.com"
    }
  },
  {
    "video": {
      "source": "/mix-hunter-game-play.mov/ik-video.mp4?updatedAt=1759792801918",
      "title": "Mix Hunter Gameplay"
    },
    "title": "Mix Hunter - TouchDesigner",
    "description": [
      "This was a project I worked on at For Good & Company. This was a collaboration between myself, as the developer, and the technical and staging staff. The idea behind this project was to demostrate a number of capabilities we had at the agency. We decided to create an interactive game because games are fun to play, they draw people in, and encourage people to socialize in an event space.",
      "I developed this project in TouchDesigner because of its ability to control what is displayed on the LED wall and what is projected onto the scrim in front of the LED wall. TouchDesigner connected with our Azure Kinect to track the laser pointer we used in our custom “phaser”. The “phaser” was battery powered microcontroller with sensors for the primer and trigger and connected back to TouchDesigner with Bluetooth."
    ],
    "tools": ["TouchDesigner", "Interactive", "Installation", "Game"]
  }
]
